-- MySQL dump 10.13  Distrib 8.0.36, for Win64 (x86_64)
--
-- Host: localhost    Database: quotes
-- ------------------------------------------------------
-- Server version	8.0.36

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `quotes`
--

DROP TABLE IF EXISTS `quotes`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `quotes` (
  `id` int NOT NULL AUTO_INCREMENT,
  `quote` text,
  `author` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=31 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `quotes`
--

LOCK TABLES `quotes` WRITE;
/*!40000 ALTER TABLE `quotes` DISABLE KEYS */;
INSERT INTO `quotes` VALUES (1,'Жизнь — это то, что с тобой происходит, пока ты строишь планы.','Джон Леннон'),(2,'Успех — это способность идти от одной неудачи к другой, не теряя энтузиазма.','Уинстон Черчилль'),(3,'Не в том счастье, чтобы много иметь, а в том, чтобы мало нуждаться.','Эпиктет'),(4,'Чем ближе человек к природе, тем меньше бед в его жизни.','Лев Толстой'),(5,'После дождя всегда выходит солнце.','Английская поговорка'),(6,'Счастье — это когда находишь то, что искал.','Леонид Сухоруков'),(7,'Больше всего на свете боюсь людей, которые могут навредить моим близким.','Михаил Шолохов'),(8,'Успех — это способность жить по-своему, не заботясь о мнении окружающих.','Дэнни Маккэскилл'),(9,'Истинное счастье — в любви к ближнему.','Марк Аврелий'),(10,'Самая большая слабость в том, что бояться изменений.','Джон Кеннеди'),(11,'Только тот, кто пошел до конца, может понять, что такое победа.','Фридрих Ницше'),(12,'Всякая история имеет свою музыку, если внимательно прислушаться.','Луи Армстронг'),(13,'Правда всегда проста, ложь всегда сложна.','Дмитрий Глуховский'),(14,'Береги пламя своей души, оно может исчезнуть в любой момент.','Виктор Гюго'),(15,'Лучший способ предсказать будущее — создать его.','Абрахам Линкольн'),(16,'Искусство быть собой — самое главное искусство.','Брюс Ли'),(17,'Необходимо верить в свои силы, иначе нечего и начинать.','Генри Форд'),(18,'Любовь — это то, что происходит, когда у вас нет других планов.','Марк Твен'),(19,'Жизнь — это то, что происходит с нами, пока мы строим планы.','Эмили Дикинсон'),(20,'Люди видят вас таким, каким хотят видеть себя.','Джефферсон Маунтин'),(21,'Смелость — это способность идти вперед, несмотря на страх.','Фрэнклин Рузвельт'),(22,'Самое важное в жизни — это не попасться в ловушку чужих ожиданий.','Эмма Уотсон'),(23,'Жизнь слишком коротка для того, чтобы просыпаться с утра с сожалением о том, что мы не живем так, как хотели бы.','Джо Харрингтон'),(24,'Лучшая защита от зла — это добро.','Сократ'),(25,'Будь смелым, чтобы начать, смелым, чтобы закончить.','Макаревич Михаил'),(26,'Когда ты хочешь, чтобы что-то изменилось, весь мир начинает помогать тебе в этом.','Пауло Коэльо'),(27,'Не гонись за быстрой победой, гонись за тем, чтобы стать лучше каждый день.','Саймон Синек'),(28,'Жизнь — это то, что происходит с нами, пока мы строим другие планы.','Эллен Глазгоу'),(29,'После каждой ночи наступает рассвет.','Пабло Пикассо'),(30,'Смелость — это не отсутствие страха, а способность действовать, несмотря на него.','Марк Твен');
/*!40000 ALTER TABLE `quotes` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-05-01 18:43:42
